In [2]:
import pandas as pd

In [3]:
data=pd.read_excel(r'C:\Users\USER\Desktop\ashish\employee.xlsx')

In [4]:
data

  gender        dob  occupation  work_exp    salary  own_house  children
0      M 1989-07-31       nurse       2.2  223700.0       True         1
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1
2      F        NaT  accountant       9.0       NaN      False         2
3      F 1987-09-17    engineer       1.7   79900.0      False         0
4      M 1993-01-24     teacher       3.6   32800.0      False         2
5      F        NaT   developer       1.8       NaN       True         1
6      F 1994-09-26       nurse       5.6  272500.0      False         1
7      M 1991-05-07      lawyer       4.1   41600.0      False         0
8      M 1994-12-04     teacher       3.3  141300.0       True         0
9      M 1987-07-10      police       6.5   68000.0       True         1

In [ ]:
employee = workbook.sheetnames
num_sheets = len('occupation')

print("Number of sheets in the Excel workbook:", num_sheets)

In [5]:
data[data['occupation']=='nurse']['occupation'].count()

2

In [6]:
data[data['occupation']=='nurse']

  gender        dob occupation  work_exp    salary  own_house  children
0      M 1989-07-31      nurse       2.2  223700.0       True         1
6      F 1994-09-26      nurse       5.6  272500.0      False         1